const characterTranslation = {
	PSshouyige: "双倍收益哥",
	PSrexusheng: "PS徐盛",
	PSsunquan: "PS孙权",
	PScaocao: "PS曹操",
	PSdianwei: "PS典韦",
	PSzhangjiao: "PS张角",
	PSsunshangxiang: "PS孙尚香",
	PSliuzan: "PS留赞",
	PSyuanshu: "骷髅王",
	PSzhanghe: "PS张郃",
	PSsh_zhangfei: "拾荒张飞",
	PStongxiangge: "同甘共苦哥",
	PSrs_wolong: "燃伤卧龙",
	PShuanggai: "PS黄盖",
	PSxushao: "PS许劭",
	PScaoxiu: "PS曹休",
	PSshen_zhuge: "PS神诸葛亮",
	PShuangyueying: "PS黄月英",
	PSshen_ganning: "PS神甘宁",
	PSguanning: "PS管宁",
	PSzhaoxiang: "PS赵襄",
	PSlukang: "PS陆抗",
	PSliru: "PS李儒",
	PScaoang: "PS曹昂",
	PSzuoci: "PS左慈",
	PSzhoutai: "PS周泰",
	PSerciyuan: "二次袁",
	PSdahantianzi: "大汉天子",
	PSnanhualaoxian: "PS南华老仙",
	PSzhangsong: "PS张松",
	PSquansun: "PS权孙",
	PSjiesuanjie: "额外结算姐",
	PSguanyunchang: "关云长",
	PSshen_zhaoyun: "PS神赵云",
	PSzhangxuan: "PS张嫙",
	PScenhun: "PS岑昏",
	PSshiniangongzhu: "十年公主",
	PScaojinyu: "PS曹金玉",
	PSzhaoyun: "PS赵云",
	PScaochun: "PS曹纯",
	PScaoshuang: "PS曹爽",
	PSxian_caozhi: "仙界曹植",
	PSsunben: "PS孙笨",
	PSduyu: "PS杜预",
	PSshen_jiangweix: "PS神姜维",
	PShs_zhonghui: "PS欢杀钟会",
	PSzhuangbeidashi: "装备大师",
	PSboss_lvbu2: "新暴怒战神",
	PSboss_lvbu3: "新神鬼无前",
	PSboss_lvbu1: "新最强神话",
	PSboss_lvbu4: "新炼狱修罗",
	PSshengui: "PS神鬼无前",
	PSzhangrang: "PS张让",
	PSxizhicai: "PS戏志才",
	PSxiahoujie: "PS夏侯杰",
	PSqun_sunce: "PS群孙策",
	PSgaoguimingmen: "高贵名门",
	PSsishouyige: "四收益哥",
	db_PSdaweiwuwang: "大魏吴王",
	PShw_sunquan: "会玩的孙权",
	PSyangbiao: "PS杨彪",
	PSguosi: "PS郭汜",
	PSshen_huangzhong: "PS神黄忠",
	PSshen_guojia: "PS神郭嘉",
	PSzhenji: "PS甄姬",
	PSwu_zhangliao: "PS武张辽",
	PSwu_zhangliao_prefix: "PS武",
	PSsunru: "PS孙茹",
	PSfuzhijie: "复制姐",
	PSfx_shen_guanyu: "羽关神",
	PSpeixiu: "PS裴秀",
	PSshen_liubei: "PS神刘备",
	PSjin_duyu: "PS晋杜预",
	PSjin_duyu_prefix: "PS晋",
	PSsb_xushao: "PS双倍许劭",
	PSxushi: "PS徐氏",
	PSjiaxu: "PS贾诩",
	PSshen_zhangliao: "PS神张辽",
	PSguanyu: "PS关羽",
	PSshen_zhangfei: "PS神张飞",
	PSmeng_liubei: "PS梦刘备",
	PSmeng_liubei_prefix: "PS梦",
	PSshen_dengai: "PS神邓艾",
	PSshen_xunyu: "PS神荀彧",
	PShaozhao: "PS郝昭",
	PSxuyou: "PS许攸",
	PSshen_sunquan: "PS神孙权",
	PSlvmeng: "PS吕蒙",
	PSshen_dianwei: "PS神典韦",
	PSzhonghui: "PS钟会",
	PSlibai: "PS李白",
	PSxie_sunquan: "PS屑孙权",
	PSshu_sunshangxiang: "PS孙尚香",
	PSmenghuo: "PS孟获",
	PSzhugeliang: "PS诸葛亮",
	PSpanzhangmazhong: "PS潘璋马忠",
	PSlingcao: "PS凌操",
	PSliubei: "PS刘备",
	PScaoren: "PS曹仁",
	PSzhangfei: "PS张飞",
	PSreluxun: "PS界陆逊",
	PSreluxun_prefix: "PS界",
	PSxurong: "PS徐荣",
	PSlifeng: "PS李丰",
	PSchenshi: "PS陈式",
	PSben_sunben: "PS笨孙笨",
	PSqun_zhaoyun: "PS群赵云",
	PSxuzhu: "PS许褚",
	PSgongsunzan: "PS公孙瓒",
	PSdongzhuo: "PS董卓",
	PShuangzhong: "PS黄忠",
	PSshen_simayi: "PS神司马懿",
	PSyue_caiwenji: "PS乐蔡文姬",
	PSyue_caiwenji_prefix: "PS乐",
	PScaopi: "PS曹丕",
	PScaoying: "PS曹婴",
	PSdian_huanggai: "PS经典黄盖",
	PSdian_huanggai_prefix: "PS经典",
	PSliaohua: "PS廖化",
	PSquyi: "PS麴义",
	PSmachao: "PS马超",
	PSqun_machao: "PS群马超",
	PSluji: "PS陆绩",
	PSluxun: "PS陆逊",
	PSlvbu: "PS吕布",
	PSshen_zuoci: "PS神左慈",
	PSreyuanshu: "PS袁术",
	PSwenyang: "PS文鸯",
	PSzhongyan: "PS钟琰",
	PSshen_nanhualaoxian: "PS神南华老仙",
	PShr_caocao: "华容曹操",
	PSshenpei: "PS审配"
}

const skillTranslation = {
	PSshelian: "奢敛",
	PSshelian_info:
		"出牌阶段限一次，你可以展示至少1张手牌，然后亮出牌堆顶至多8张牌，对比其中的花色数：若展示牌的花色数大于亮出牌的花色数，你摸X张牌（X为此次亮出的牌数）；否则，你失去一点体力。",
	PSjixi: "觊玺",
	PSjixi_info:
		"觉醒技，结束阶段，若你连续三回合没有因〖奢敛〗而失去过体力，则你增加1点体力上限并回复1点体力，然后选择一项：获得技能〖妄尊〗：摸两张牌并获得当前主公的主公技。",
	PSshen_huashen: "化身",
	PSshen_huashen_info:
		"游戏开始时，你将剩余武将牌堆的两张牌置于武将牌上，称为“魂”，然后你可将一张“魂”作为你的表象武将展示；若表象角色未阵亡，则回合开始前或回合结束后，你可以用一张其他“魂”替换表象角色；若表象角色已阵亡，你可以展示一张武将牌上的“魂”并将其置入剩余武将牌堆，视为使用一张本回合内未以此法使用过的基本牌或普通锦囊牌。",
	PSshen_jihun: "汲魂",
	PSshen_jihun_info:
		"当[你受到伤害后]，或[其他角色脱离濒死状态后]，你可以将剩余武将牌堆的一张牌置于武将牌上，称为“魂”",
	PSshen_xinsheng: "新生",
	PSshen_xinsheng_info:
		"锁定技，当你即将阵亡时，你须选择一项：①将表象角色置入剩余武将牌堆，并变为本体武将；②删去〖汲魂〗第一个获得“魂”的途径；③删去〖汲魂〗第二个获得“魂”的途径。然后终止阵亡结算并回复体力至剩余选项数+1。",
	PSwushuang: "无双",
	PSwushuang_info:
		"锁定技。①若你有空置的武器栏，则视为你装备【无双方天戟】。②当你使用【杀】或【决斗】指定目标后，你令此牌需要依次使用或打出两张【闪】或【杀】响应。",
	PSbaifu: "拜父",
	PSbaifu_info:
		"当你对一名其他角色A造成伤害时，若其不是“义父”，你可以防止此伤害。若如此做，你对场上的“义父”B造成一点伤害并移去B的“义父”标记，然后你获得A的一张牌并令A获得“义父”标记。",
	"#PSbaifu1": "公若不弃，布愿拜为义父。",
	"#PSbaifu2": "飘零半生，只恨未逢明主。",
	PSpanshi: "叛弑",
	PSpanshi_info:
		"锁定技。①当“义父”于一回合内首次使用伤害类牌前，若你不是此牌的唯一目标，此牌的目标排除你。然后若你满足使用此牌的合法性，你成为此牌的使用者。②当你对“义父”造成伤害时，此伤害+1。",
	PSqianxun: "谦逊",
	PSqianxun_info:
		"锁定技，你不能成为【过河拆桥】、【顺手牵羊】和延时锦囊牌的目标。",
	PSlianying: "连营",
	PSlianying_info:
		"当你使用或打出牌时，你可以摸X张牌（X为4-你的手牌花色数）。",
	PShuaiju: "怀橘",
	PShuaiju_info:
		"锁定技，游戏开始时，你获得3个“橘”标记。（有“橘”的角色受到伤害时，防止此伤害，然后移去一个“橘”；有“橘”的角色摸牌时额外摸其拥有的“橘”标记数张牌）",
	PSzhenglun: "整论",
	PSzhenglun_info: "你可以跳过摸牌阶段然后获得一个“橘”。",
	PSzhuiming: "追命",
	PSzhuiming_info:
		"当你使用【杀】指定距离为1的目标时，你可以令目标角色选择一项：1.此【杀】令其防具无效、不可响应且对其造成伤害+1；2.其获得此【杀】对应的实体牌，然后你获得其两张牌。",
	PSjinge: "金戈",
	PSjinge_info:
		"锁定技，你计算与其他角色的距离时-2。你的牌名数为2的牌均视为不计入次数且无次数限制【杀】。",
	PStieji: "铁骑",
	PStieji_info:
		"当你使用【杀】指定其他角色为目标后，你可以令目标角色不能响应此【杀】，且其非锁定技失效直到回合结束。然后你与其进行谋弈。<br>若你赢，你本回合使用的【杀】次数上限+1，且其非锁定技失效的效果延续至其回合结束。然后你选择的选项为:“直取敌营”，则你获得其一张牌:“扰阵疲敌”，你摸两张牌。<br>若你没赢，你可以执行你选择的另一项，若如此做，你本回合对其发动此技能时不能与其进行谋弈。",
	PScema: "策马",
	PScema_info:
		"锁定技，你计算与其他角色的距离时-1，你可以将一张坐骑牌当作伤害基数为2的【杀】使用或打出。",
	PSjiaozi: "骄恣",
	PSjiaozi_info:
		"锁定技。①当你造成或受到伤害时，若你的手牌数不小于对方，此伤害+1。②回合开始时/弃牌阶段开始时，你摸/弃置X张牌（X为场上体力值不大于你的角色数）。",
	PSfuqi: "伏骑",
	PSfuqi_info:
		"锁定技。①当你使用牌时，你令所有与你距离为1的其他角色不能使用或打出牌响应此牌。②你与所有与你距离为1的角色的距离视为1。",
	PSdangxian: "当先",
	PSdangxian_info:
		"锁定技，回合开始时，你执行一个额外的摸牌阶段和出牌阶段。摸牌阶段和出牌阶段开始时，你从牌堆中获得一张不计入手牌上限【杀】并记录之。结束阶段，若你有“当先”记录过的杀，弃置之并失去X点体力，然后视为使用一张伤害类锦囊牌。（X为“当先“记录过的杀的数量）",
	PSfuli: "伏枥",
	PSfuli_info:
		"每轮限一次，当你处于濒死状态时，你可以减一点体力上限并弃置“当先”记录过的【杀】，再将体力回复至体力上限，然后随机抽取五张武将牌并获得其中一个技能。最后若你的武将牌正面朝上，你翻面。",
	PSshiming: "拾命",
	PSshiming_info:
		"锁定技，每回合限一次，当你进入濒死状态时，若你的体力上限大于1，你减1点体力上限并回复一点体力，获得第一个你未拥有的技能:〖勤国〗、〖咆哮〗、〖不屈〗。",
	PSlingren: "凌人",
	PSlingren_info:
		"当一名角色于本回合首次成为你使用牌的目标后，你可以猜测其手牌构成，若猜对：<br>至少0项，你摸两张牌；<br>至少1项，本回合你对其造成伤害时，你可以令此伤害+1或-1；<br>至少2项，直到下一轮开始时，你发动〖伏间〗额外指定其为目标；<br>至少3项，你随机获得魏势力主公武将牌上的一个技能，直到你的回合开始。",
	PSfujian: "伏间",
	PSfujian_info:
		"锁定技，结束阶段开始时，你可以观看一名其他角色的随机X张手牌（X为你与其的体力之差且至少为1）。",
	PSfangzhu: "放逐",
	PSfangzhu_info:
		"①当你受到伤害后，你可以令一名角色：1.摸一张牌并将武将牌翻面；2.失去一点体力并弃置一张牌。②翻面状态与你不同的角色，在其回合内不能对你使用牌。",
	PSxingshang: "行殇",
	PSxingshang_info:
		"锁定技。①当一名角色翻面后，你与其各摸一张牌。②当一名角色死亡时，你回复一点体力并选择一项：1.视为受到过一点伤害；2.获得其所有牌。",
	PSshuangjia: "霜笳",
	PSshuangjia_info:
		"锁定技。①游戏开始时/当你不因〖悲愤〗而获得牌时，你将你的手牌/这些牌标记为“胡笳”。②你的“胡笳”牌不计入手牌上限。③其他角色至你的距离+X（X为你的“胡笳”数且至多为5）。",
	PSrenjie: "忍戒",
	PSrenjie_info:
		"锁定技，当你受到1点伤害后/于弃牌阶段内每弃置一张牌后，你选择获得{〖鬼才〗、〖放逐〗、〖集智〗、〖制衡〗、〖完杀〗}中的一个技能。",
	PSbaiyin: "拜印",
	PSbaiyin_info:
		"觉醒技，当你因〖忍戒〗获得技能后，若你拥有〖忍戒〗的所有衍生技，你减1点体力上限，失去技能〖忍戒〗，然后获得〖连破〗。",
	PSxujin: "蓄劲",
	PSxujin_info:
		"锁定技，若X：<br>不小于1，你使用【杀】无距离限制；<br>不小于2，你使用【杀】不可被响应；<br>不小于3，你使用【杀】造成伤害+Y。<br>当你使用【杀】结算后，若X不小于4，你将手牌摸至体力上限，记录Z为此时本回合使用过的牌数，然后本回合X修改为本回合使用过的牌数-Z。 (X为本回合使用过的牌数，Y为本回合使用过的花色数-1)",
	PSrepaoxiao: "咆哮",
	PSrepaoxiao_info:
		"锁定技。①你使用【杀】无次数限制。②若你的装备区内有武器牌，则你使用【杀】无距离限制。③当你于一回合内首次使用或打出【杀】时，你收回此【杀】对应的实体牌。",
	PSliyong: "厉勇",
	PSliyong_info:
		"锁定技。<br>①当你使用【杀】指定目标后，若你本回合使用过的【杀】：被响应过，此【杀】不可被响应；数量不为1，此【杀】对其造成伤害+1。<br>②当你使用【杀】对一名其他角色造成伤害后，其本回合非锁定技失效。<br>③一名角色回合结束时，若你本回合使用过的【杀】因〖厉勇〗触发了{强命/加伤/铁骑}效果，你摸X张牌（X为触发的项数）。",
	PSlingbao: "凌暴",
	PSlingbao_info:
		"每阶段限一次，当你于出牌阶段内使用♣或♠牌时，若此牌花色与你于此阶段使用的上一张牌花色相同，你可以令此牌额外结算一次。",
	PSjiuchi: "酒池",
	PSjiuchi_info:
		"你可以将一张♠牌当【酒】 使用，你使用【酒】无次数限制。",
	PSzongyu: "纵欲",
	PSzongyu_info:
		"锁定技，①当一名女性角色受到伤害后，你获得其一张牌。②结束阶段，若场上有存活的女性角色，你须减一点体力或体力上限。",
	PSdangkou: "荡寇",
	PSdangkou_info:
		"出牌阶段限一次，你可以选择一项：1.失去一点体力并增加一点体力上限，然后视为使用一张【杀】（不计入使用次数）；2.回复一点体力并减一点体力上限，然后摸两张牌。",
	PSbaima: "白马",
	PSbaima_info:
		"锁定技，你计算与其他角色距离时-X，其他角色计算与你的距离时+Y（X为你的体力值，Y为你已损失的体力值，至少为1）。",
	PSluoyi: "裸衣",
	PSluoyi_info:
		"出牌阶段限两次，你可以废除一个装备栏，视为使用一张【决斗】。当你以此法使用【决斗】对其他角色造成伤害时，若你装备区的牌数不大于目标角色，此伤害+1。",
	PShanzhan: "酣战",
	PShanzhan_info:
		"每回合限一次，当一名角色进入濒死状态时，你可以弃置至多两张牌，恢复等量的装备栏，然后你将手牌摸至4张。",
	PSlongwei: "龙威",
	PSlongwei_info:
		"当你使用杀指定目标或成为杀的目标时，你可以弃置对方的一张牌，若弃置牌的颜色与该杀的颜色相同，你获得之。",
	PSqiangshu: "枪术",
	PSqiangshu_info:
		"每回合限一次，你可以将一张牌当【杀】使用或打出（无距离限制且不计入次数），你以此法使用的【杀】额定目标数为X（X为此牌的牌名数）。",
	PShunzi: "魂姿",
	PShunzi_info:
		"觉醒技，准备阶段，你加一点体力上限，并获得技能〖英姿〗、〖英魂〗和〖毒武〗。",
	PSduwu: "毒武",
	PSduwu_info:
		"觉醒技，准备阶段，若你于此回合没有发动技能〖魂姿〗，你加一点体力上限，并获得技能〖毒逝〗、〖耀武〗和〖仇殇〗。",
	PSchoushang: "仇殇",
	PSchoushang_info:
		"觉醒技，准备阶段，若你于此回合没有发动技能〖毒武〗，你加一点体力上限，并获得技能〖仇海〗、〖燃殇〗和〖坏疾〗。",
	PShuaiji: "坏疾",
	PShuaiji_info:
		"觉醒技，准备阶段，若你于此回合没有发动技能〖仇殇〗，你加一点体力上限，并获得技能〖崩坏〗、〖同疾〗和〖缠祸〗。",
	PSchanhuo: "缠祸",
	PSchanhuo_info:
		"觉醒技，准备阶段，若你于此回合没有发动技能〖坏疾〗，你加一点体力上限，并获得技能〖缠怨〗和〖链祸〗。",
	PSqingbei: "擎北",
	PSqingbei_info:
		"一轮游戏开始时，你可以选择任意种花色。然后你本轮使用牌后，若此牌的花色与你以此法选择花色均不相同，你摸X张牌，否则你须弃置X张牌（X为你本轮以此法选择过的花色数）。",
	PStunchu: "屯储",
	PStunchu_info:
		"①锁定技，游戏开始时，你摸两张牌，然后将两张手牌置于武将牌上，称为「粮」；<br/>②摸牌阶段，你额外摸X张牌，你的手牌上限+X（X为你的「粮」数）；<br/>③摸牌阶段结束时，若你的“粮”数不大于Y，你可以将至多Y张手牌置于武将牌上（Y为你的体力上限，且至多为3）。",
	PSshuliang: "输粮",
	PSshuliang_info:
		"一名角色的结束阶段开始时，若其手牌数少于手牌上限，你可以移去一张「粮」，然后该角色摸两张牌。",
	PSxionghuo: "凶镬",
	PSxionghuo_info:
		"游戏开始时，你获得3个“暴戾”标记。出牌阶段，你可以交给一名其他角色一个“暴戾”标记。当你对有“暴戾”标记的其他角色造成伤害时，此伤害+X。有“暴戾”标记的其他角色的出牌阶段开始时，其移去所有“暴戾”标记并随机执行X项：1.受到1点火焰伤害且本回合不能对你使用【杀】；2.失去1点体力且本回合手牌上限-1；3.你随机获得其一张手牌和一张装备区的牌。（X为目标角色的“暴戾”标记数）",
	PSshajue: "杀绝",
	PSshajue_info:
		"锁定技，其他角色进入濒死状态时，你获得一个“暴戾”标记。然后若其体力值小于0，你获得使其进入濒死状态的牌。",
	PSreqianxun: "谦逊",
	PSreqianxun_info:
		"每当一张延时类锦囊牌或其他角色使用的普通锦囊牌生效时，若你是此牌的唯一目标，你可以将所有手牌置于你的武将牌上，你可以如手牌般使用或打出以此法置于武将牌上的牌。若如此做，此回合结束时，你获得你武将牌上的所有牌。",
	PSrelianying: "连营",
	PSrelianying_info:
		"①当你失去最后的手牌时，你可以令至多X名角色各摸一张牌（X为你此次失去的手牌数）。<br>②当你使用或打出牌后，你可以弃置当前回合角色一张手牌，然后摸一张牌。",
	PSjushou: "据守",
	PSjushou_info:
		"一名角色回合开始时或当你需要使用非延时锦囊牌时，若你的武将牌正面朝上，你可以翻面并视为你使用一张你需要的非延时锦囊牌。当你翻面后，你可以弃置一张牌然后选择：1．回复一点体力：2．移动场上一张牌。",
	PSbianzhen: "变阵",
	PSbianzhen_info:
		"锁定技，当你受到伤害后，若你的手牌数：不大于X，你摸X张牌；不小于X，你摸1张牌（X为你的体力上限）。然后若你的武将牌背面朝上，你翻面。",
	PStishen: "替身",
	PStishen_info:
		"锁定技，准备阶段开始时，你获得一张点数随机、花色随机、包含所有属性的【杀】，然后你将此【杀】添加“替身”标记。当你失去一张“替身牌”后，你回复1点体力并摸两张牌。你的手牌上限+X（X为你拥有的“替身牌”数量）。",
	PSrende: "仁德",
	PSrende_info:
		"出牌阶段，你可以令一名角色将至少一张手牌交给由你指定的其他角色，然后本阶段你不能再对该角色发动〖仁德〗；若其交出的牌不少于两张，其可以视为使用一张基本牌。",
	PSdujin: "独进",
	PSdujin_info:
		"锁定技，摸牌阶段你额外摸X张牌，你的手牌上限+X（X为你装备区里的装备牌数量且至少为1）。",
	PSgudan: "孤胆",
	PSgudan_info:
		"锁定技，当你受到其他角色造成的伤害时，若此伤害不为手牌造成的伤害，此伤害+1；当你成为黑色锦囊牌的唯一目标时，你须弃置一张牌或者失去一点体力。",
	PSduodao: "夺刀",
	PSduodao_info:
		"当你受到其他角色的伤害后或成为其他角色杀的目标时，你可以摸一张牌并获得伤害来源／该角色的一张牌。若未从其手牌区获得牌则你额外摸一张牌。",
	PSanjian: "暗箭",
	PSanjian_info:
		"锁定技，武器栏没有牌的角色不能对你使用【杀】，不可响应你使用的【杀】，且受到你的【杀】伤害+1。",
	PSjiqiao: "机巧",
	PSjiqiao_info:
		"锁定技，游戏开始时，你将【木牛流马】、【八卦阵】、【诸葛连弩】置入你的对应装备栏。当一名角色触发上述装备效果时，你摸一张牌。",
	PShuoji: "火计",
	PShuoji_info:
		"出牌阶段限三次，你可以从牌堆中检索并获得牌名或描述里带有“火”字的牌。",
	PSpingnan: "平南",
	PSpingnan_info:
		"出牌阶段限一次，你可以对至多三名角色造成1点伤害，然后获得其中一名角色区域内的一张牌。",
	PShuoshou: "祸首",
	PShuoshou_info:
		"锁定技。①【南蛮入侵】对你无效。②当其他角色使用【南蛮入侵】指定第一个目标后，你代替其成为此牌的伤害来源。③当你的【南蛮入侵】对一名角色造成伤害后，你可以获得对方一张牌。",
	PSxingluan: "兴乱",
	PSxingluan_info:
		"锁定技，当一张【南蛮入侵】结算完毕后，你可以弃置X张牌，获得这张【南蛮入侵】（X为此【南蛮入侵】的指定目标数-造成伤害数）。",
	PSshixian_ping: "平",
	PSshixian_ze: "仄",
	PSliangzhu: "良助",
	PSliangzhu_info:
		"当一名角色回复体力后，你可以摸一张牌，然后你可以弃置一张牌令其摸两张牌。",
	PSfanxiang: "返乡",
	PSfanxiang_info:
		"觉醒技，准备阶段开始时，若场上有已受伤且你发动过〖良助〗令其摸牌的角色，则你选择一项：1.增加一点体力上限并回复一点体力；2.获得技能〖枭姬〗；3.背水：失去技能〖良助〗，然后依次执行上述所有选项。",
	PSzongheng: "纵横",
	PSzongheng_info:
		"出牌阶段限X次，你可以弃置任意张花色相同或不同的手牌，并摸等量的牌。若弃置的牌大于三张，你多摸一张牌（X为你本回合未以此法弃置的花色数）。",
	PSxiqu: "袭取",
	PSxiqu_info:
		"限定技，出牌阶段，你可以选择一名其他角色，你令其弃置装备区所有牌，且可以获得其至多两张手牌。",
	PSchengchen: "称臣",
	PSchengchen_info:
		"觉醒技，当你杀死一名角色后，你将所有手牌交给一名其他“魏”势力角色，将势力改为“魏”，然后失去技能〖纵横〗，获得技能〖制衡〗。",
	PSjiuxian: "酒仙",
	PSjiuxian_info:
		"①你可以将额定目标数大于1的锦囊牌当做【酒】使用。②你使用【酒】无次数限制。③当你使用【酒】后，你使用的下一张牌无视条件触发技能〖诗仙〗。",
	PSshixian: "诗仙",
	PSshixian_info:
		"当你使用一张牌时，若此牌牌名的最后一个字的平仄声与你于本局游戏使用的上一张牌的不同，则你可以摸一张牌，并令此牌额外结算一次。(以平水韵为标准)",
	PSpaiyi_backup: "权术",
	PSquanshu: "权术",
	PSquanshu_info:
		"当你造成或受到伤害后，你可以摸Y张牌，然后将一张手牌置于你的武将牌上，称为“权”，你的手牌上限+Z（Y为你已损失的体力值，Z为“权”的数量）。",
	PSpaiyi: "排异",
	PSpaiyi_info:
		"出牌阶段限一次，你可以移去一张“权”并令一名角色摸Z张牌，然后其对至多Z名角色各造成1点伤害（Z为“权”的数量且至少为1）",
	PSjuanjia: "捐甲",
	PSjuanjia_info:
		"锁定技，游戏开始时，你废除一个宝物栏、防具栏、攻击马栏和防御马栏，然后获得等量的额外武器栏。",
	PSbolan: "博览",
	PSbolan_info:
		"锁定技,摸牌阶段,你改为摸与你体力值相等的牌，然后你记录本次以此法摸的牌为X，你获得X-2个“识”标记。每有一个“识”，你的手牌上限+1，计算与其他角色的距离-1。准备阶段,若你的“识”不小于5,你获得〖攻心〗。",
	PSgongxin: "攻心",
	PSgongxin_info:
		"转换技,出牌阶段限一次。阳:你可以观看一名其他角色的手牌，然后获得其中任意张花色相同的牌。阴:你可以观看一名其他角色的手牌,然后选择获得其中任意张花色不同的牌。每以此法获得一张牌，你移去一个“识”。结束阶段,若你的“识”小于5，你失去〖攻心〗。",
	PSyuheng: "驭衡",
	PSyuheng_info:
		"①回合开始时，你可以弃置任意张花色不同的牌，然后摸等量的牌并获得等量吴势力的技能。②回合结束时，你可以选择失去任意个因〖驭衡①〗获得的技能，然后摸等量的牌。",
	PSdili: "帝力",
	PSdili_info:
		"觉醒技，当你因〖驭衡①〗获得的技能数大于你的体力上限时，你失去技能〖驭衡〗，然后获得技能〖圣质〗、〖权道〗、〖持纲〗。",
	PSfenyin: "奋音",
	PSfenyin_info:
		" 你的回合内，当你使用第X张牌时，你摸X张牌。（X最多为5）",
	PSjieyin: "结姻",
	PSjieyin_info:
		"出牌阶段限一次，你可以选择一名男性角色并弃置一张手牌或将装备区内的一张装备牌置于其装备区，你与其之中体力值等于体力上限的角色摸一张牌，体力值小于体力上限的角色摸一张牌的角色回复1点体力。",
	PSxiaoji: "枭姬",
	PSxiaoji_info:
		"当一张装备牌进入或离开你的装备区后，你可以摸一张牌，若当前回合角色不是你，你改为摸三张牌。",
	PSliangquan: "两全",
	PSliangquan_info:
		"锁定技，当你使用【杀】或【决斗】指定目标后，你令此牌需要依次使用或打出两张【闪】或【杀】响应。",
	PSshuangquan: "双全",
	PSshuangquan_info:
		"锁定技。<br/>①你视为拥有技能〖马术〗〖飞影〗和〖无双〗。<br/>②你使用【杀】可以额外指定一名目标。<br/>③你造成的所有伤害翻倍，你受到的所有伤害减半（向上取整）。<br/>④你拥有双倍的初始手牌。摸牌阶段，你额外摸等量的牌。<br/>⑤你使用牌后，额外使用对应实体卡牌（不嵌套触发）。<br/>⑥当你不因此技能获得的回合结束后，你执行一个额外的回合。<br/>⑦限定技，当你即将阵亡时，终止此次结算，然后你将体力上限调整为8，再将体力值回复至体力上限。<br/>⑧游戏开始时，你获得等量的装备区副类别栏。<br/>⑨你回复体力时，回复效果翻倍。<br/>⑩你使用【铁索连环】时可额外指定两名目标，使用单体普通锦囊牌时可额外指定一名目标。",
	PSpojun: "破军",
	PSpojun_info:
		"当你使用【杀】指定目标后，你可以获得其至多X张牌（X为其体力值）。当你因执行【杀】的效果而对一名角色造成伤害时，若该角色的手牌数和装备区内的牌数均不大于你，则此伤害+1。",
	PStongxiang: "同享",
	PStongxiang_info:
		"当其他角色于摸牌阶段外获得牌后，你可以摸等量的牌；当你的牌因弃置进入弃牌堆时，你可以令一名其他角色弃置等量的牌。",
	PSshihuang: "拾荒",
	PSshihuang_info:
		"每当其他角色有牌非因使用或打出进入弃牌堆时，你可以获得之。",
	PSpaoxiao: "咆哮",
	PSpaoxiao_info:
		"锁定技，出牌阶段，你使用【杀】没有数量限制。当你于回合内使用的【杀】数量不大于X，则你跳过你的弃牌阶段。（X为当前场上存活的人数）",
	PSleiji: "雷击",
	PSleiji_info:
		"当一名角色使用或打出一张【闪】时，你可令一名其他角色进行一次判定：若结果为梅花，其受到一点雷电伤害，然后你回复一点体力；若结果为黑桃，其受到两点雷电伤害。",
	PSqiangxi: "强袭",
	PSqiangxi_info:
		"出牌阶段限两次。你可以弃置一张武器牌或受到1点无来源伤害，然后对一名本回合内未成为过〖强袭〗目标的其他角色造成X点伤害。（X为你本局游戏发动此技能的次数）",
	PSsizhan: "死战",
	PSsizhan_info:
		"使命技。①每回合限一次，当你受到伤害时，若你本局发动过〖强袭〗的次数不为0，你可以令此伤害-1，然后本局游戏〖强袭〗发动次数-1。②使命:杀死一名角色。③成功：你减2点体力上限，然后获得技能〖不屈〗和〖绝境〗。④失败:当你于使命达成前进入濒死状态，你将体力值回复至体力上限，然后重置〖强袭〗的发动次数。",
	PSranshang: "燃伤",
	PSranshang_info:
		"当你对一名角色造成火焰伤害后，你可以令目标随机弃置一张牌，并获得等同于伤害数的“燃”标记；有“燃”的角色结束阶段开始时，其失去X点体力。（X为“燃”标记的数量）",
	PSzhiheng: "制衡",
	PSzhiheng_info:
		"①出牌阶段限一次/②每回合限一次，当你成为一名角色使用牌的唯一目标时，你可以弃置任意张牌并摸等量的牌，若你在发动此技能时弃置了所有手牌，则你多摸一张牌。",
	PSjianxiong: "奸雄",
	PSjianxiong_info:
		"当一名其他角色使用牌指定你为目标，你可以于此牌对你结算后从处理区/弃牌堆中获得此牌并摸一张牌。",
	PSqifan: "七反",
	PSqifan_info:
		"锁定技，游戏开始时，你的身份更改为主公，你令其他角色的身份更改为反贼且明置。",
	PSjiwei: "继位",
	PSjiwei_info:
		"锁定技，当你对主公使用【杀】造成伤害后，若你的身份不是主公，你与主公交换身份，然后增加一点体力上限并回复一点体力。",
	PSqiaobian: "巧变",
	PSqiaobian_info:
		"你可以摸一张牌并跳过自己的一个阶段(准备阶段和结束阶段除外)；若你以此法跳过了摸牌阶段，则你可以获得至多两名其他角色的各一张手牌；若你以此法跳过了出牌阶段，则你可以移动场上的一张牌。",
	PSkurou: "苦肉",
	PSkurou_info: "出牌阶段，你可以弃置一张牌，然后失去1点体力。",
	PSpingjian: "评荐",
	PSpingjian_info:
		"准备阶段开始时/摸牌阶段开始时/结束阶段开始时/当你受到伤害后/当你进入濒死状态时/出牌阶段限一次，你可以令系统随机从剩余武将牌堆中检索出三张拥有发动时机为准备阶段开始时/摸牌阶段开始时/结束阶段开始时/当你受到伤害后/进入濒死状态时/出牌阶段的技能的武将牌。然后你可以选择尝试发动其中一个技能。每个技能每局只能选择一次。",
	PSqianju: "千驹",
	PSqianju_info:
		"锁定技，游戏开始时，废除你的一个攻击马栏和防御马栏；你计算与其他角色之间的距离减X，其他角色计算与你之间的距离+X；你的坐骑牌均视为杀。（X为你当前已损失的体力值且至少为1）",
	PSqingxi: "倾袭",
	PSqingxi_info:
		"当你使用伤害类锦囊或杀指定一名其他角色时，你可以弃置其1张牌，若此牌造成伤害，该伤害+1；若本回合此技能的发动次数等于你的攻击范围，你令此技能失效直到本回合结束。",
	PSqixing: "七星",
	PSqixing_info:
		"游戏开始时/准备阶段开始时，若你的“星”少于7，你将牌堆顶的牌至于你的武将牌上，称之为“星”，你的“星”至多为7。然后/摸牌阶段结束后，你可用任意数量的手牌等量交换这些“星”。",
	PSkuangfeng: "狂风",
	PSkuangfeng_info:
		"结束阶段，你可以弃置X张“星”并指定等量的角色：直到你的出牌阶段结束，该角色受到火焰伤害时，此伤害+1。",
	PSdawu: "大雾",
	PSdawu_info:
		"结束阶段，你可以弃置X张“星”并指定等量的角色：直到你的出牌阶段结束，当这些角色受到非雷电伤害时，防止此伤害。",
	PSjizhi: "集智",
	PSjizhi_info:
		"锁定技，当你使用字数不小于3的牌时，你展示牌堆顶两张牌，获得其中字数较多的一张，若字数相同则改为随机获得其中一张，然后将其余的牌置入弃牌堆。",
	PSqicai: "奇才",
	PSqicai_info:
		"锁定技，你使用字数不小于2的牌无距离限制，使用字数不小于1的牌无次数限制，你的手牌上限+X。（X为本回合不因使用而进入弃牌堆的牌数）",
	PSjieying: "劫营",
	PSjieying_info:
		"回合开始时，若场上没有拥有“营”标记的角色，你获得1个“营”标记；结束阶段，你可以将你的一个“营”标记交给一名角色；有“营”标记的角色摸牌阶段多摸一张牌，出牌阶段使用【杀】的次数上限+1，手牌上限+1。有“营”的其他角色出牌阶段开始时，其移去“营”标记，然后你获得其所有手牌。",
	PSfushi: "扶世",
	PSfushi_info:
		"结束阶段开始时，你可以移去所有“梅影”标记并摸等量张牌，然后从8张武将牌中选择并获得至多3个技能。若此时你是体力值最低的角色，你回复1点体力。",
	// "PSfushi_append": '<span style="font-family: yuanli">开启扩展“天牢令”体验更佳</span>',
	PSdunshi: "遁世",
	PSdunshi_info:
		"每回合限一次。你可以视为使用或打出一张即时牌，然后当前回合角色于本回合内下一次造成伤害时，你选择两项：<br/>⒈防止此伤害。系统从技能描述中包含“出牌/受伤/结束”字样的技能中随机选择4个其未拥有的技能，然后你令当前回合角色获得其中一个技能。<br/>⒉从〖遁世〗中删除你本次使用或打出的牌并获得一个“席”。<br/>⒊减1点体力上限并摸X张牌（X为你的“席”数）。",
	PSjueyan: "决堰",
	PSjueyan_info:
		"出牌阶段限一次，你可以废除一种装备栏，然后执行对应一项：武器栏，你使用【杀】的次数上限+3；防具栏，你摸三张牌，且手牌上限+3；坐骑栏，你使用牌无距离限制；宝物栏，你获得〖集智〗。",
	PSjuece: "绝策",
	PSjuece_info:
		"出牌阶段，你可以弃置一张【火杀】或【火攻】，然后重置技能〖焚城〗。结束阶段，你可以对一名本回合内失去过牌的角色造成1点伤害。",
	PSkangkai: "慷慨",
	PSkangkai_info:
		"当一名角色成为伤害类牌的目标后，你可以摸一张牌。若如此做，你选择一名除其外的角色，除非该角色交一张牌给对方，否则失去一点体力。若交出的是装备牌，该角色可以使用此牌。",
	PSjiwu: "极武",
	PSjiwu_info:
		"出牌阶段，你可以弃置一张牌，然后选择获得【强袭】、【铁骑】、【旋风】、【完杀】中的一项技能直到回合结束。",
	PSshenqu: "神躯",
	PSshenqu_info:
		"每名角色的准备阶段，若你的手牌数少于或等于你的体力上限数，你可以摸两张牌；当你受到伤害后，你可以使用一张【桃】。",
	PSmn_qiangxi: "强袭",
	PSmn_qiangxi_info:
		"出牌阶段对每名其他角色限一次，你可以失去1点体力并摸一张牌，对你攻击范围内的一名其他角色造成1点伤害；其他角色受到伤害时，你可以弃置一张装备牌并令伤害值+1。",
	PShuiwan: "会玩",
	PShuiwan_info:
		"你可以将〖制衡〗获得的牌当任意基本牌或锦囊牌使用或打出。",
	PShuashen: "化身",
	PShuashen_info:
		"①游戏开始时，你随机获得三张未加入游戏的武将牌（均称为“化身牌”），然后你选择一项：1、制衡化身：弃置至多两张化身牌并获得等量+1张化身牌；2、更换技能：移除上次因化身获得的所有技能（若有），然后重新挑选化身牌上的至多三个技能。准备阶段或回合结束阶段开始时，你可以选择“制衡化身”或“更换技能”。<br/>②出牌阶段限一次，你可以将性别和势力改为与一张“化身牌”相同。",
	PSxinsheng: "新生",
	PSxinsheng_info: "当你受到一点伤害后，你可以获得一张“化身牌”。",
	PSbuqu: "不屈",
	PSbuqu_info:
		"锁定技，当你处于濒死状态时，你亮出牌堆顶的一张牌并置于你的武将牌上，称之为“创”。若此牌的点数与你武将牌上已有的“创”点数均不同，则你回复至1点体力。若点数相同，则将此牌置入弃牌堆。只要你的武将牌上有“创”，你的手牌上限/摸牌阶段摸牌数/〖奋激〗摸牌数/【杀】使用次数便+X（X为“创”的数量）。",
	PSfenji: "奋激",
	PSfenji_info:
		"当一名角色的手牌不因赠予或交给而被其他角色获得后，或一名角色的手牌被其他角色弃置后，你可以令其摸两张牌。",
	PSzanhe: "暂和",
	PSzanhe_info:
		"①你于回合内使用牌或于回合外失去牌后，可以重铸两张牌；<br/>②你每阶段使用杀的次数＋5且目标＋1，你使用普通锦囊牌时目标可以指定任意名角色；<br/>③每轮结束时，若你杀死过其他角色，则你须流失一点体力或弃置两张牌。",
	PSshengshi: "盛世",
	PSshengshi_info:
		"锁定技，每当有角色回复体力后，若场上没有处于濒死状态的角色，你令每名角色失去一点体力并弃置其一张牌（若其没有牌，则改为其失去一点体力）。",
	PSluanshi: "乱世",
	PSluanshi_info:
		"锁定技，每当你成为伤害类牌的目标后，展示并弃置牌堆顶三张牌，若点数之和：<br/>① 大于21，你恢复一点体力；<br/>②等于21 ，你流失一点体力；<br/>③小于21，你令来源承受此效果。",
	PSshanrang: "禅让",
	PSshanrang_info:
		"主公技，锁定技，当你濒死时摸两张牌并与一名角色拼点，①若你赢则令其成为主公并获得〖盛世、乱世、禅让〗技能且你阵亡；②若你没赢则令全场流失一点体力且你阵亡。（若无法拼点则你选择一名其他角色令其执行效果① ）​",
	PSyufeng: "御风",
	PSyufeng_info:
		"出牌阶段限两次，你可以选择X项（X为当前游戏轮数）:<br/>1.你可以选择一名角色让其摸5张牌，再将手牌弃置为X（X为其体力上限）。<br/>2.你选择2名角色调换座位。<br/>3.摸两张牌。<br/>4.选择至多3名角色各弃置其2张牌。<br/>当你的体力值变动时，你可令其中一项发动两次。",
	PStianshu: "天书",
	PStianshu_info: "锁定技，你的宝物区视为装备【太平要术】。",
	PSyinshi: "隐士",
	PSyinshi_info: "锁定技，你只有摸牌阶段、出牌阶段和弃牌阶段。",
	PSshenwu: "神武",
	PSshenwu_info:
		"锁定技，你的♥牌均视为【桃】；你的【桃】可以对其他角色使用。",
	PShunwu: "魂武",
	PShunwu_info:
		"当你回复体力至满状态后，你可以进行一次判定，若结果不为【杀】【决斗】【南蛮入侵】【万箭齐发】【火攻】，你令一名已阵亡的角色复活并回复体力至体力上限。",
	PSqiangzhi: "强识",
	PSqiangzhi_info:
		"出牌阶段开始时，你可以观看并展示一名其他角色的一张手牌。若如此做，当你于此阶段内使用与此牌类别相同的牌时，你可以摸一张牌。",
	PSxiantu: "献图",
	PSxiantu_info:
		"一名其他角色的出牌阶段开始时，你可以摸两张牌，然后交给其一张牌，再获得其两张牌。若如此做，此阶段结束时，若该角色未于此阶段内杀死过角色，则你失去1点体力。",
	PShengzhi: "衡制",
	PShengzhi_info:
		"出牌阶段限X次，你可以摸你手牌区和装备区牌数量的牌，然后弃置等量的牌。（X为你已损失的体力值且至少为1）",
	PSnengwan: "能玩",
	PSnengwan_info:
		"锁定技，你的摸牌阶段和出牌阶段阶段不能被跳过。",
	PSzailaiyici: "再来",
	PSzailaiyici_info:
		"一名角色使用即时牌指定第一个目标后，你可令此牌额外结算一次。",
	PSweizhen: "威震",
	PSweizhen_info:
		"①你拥有以下效果：<br/>1：使用红色杀的距离+0 ；<br/>2：使用红色杀造成伤害+0；<br/> 3：使用红色杀可以额外指定0名目标；<br/>4：使用红色杀的次数+0；<br/>5：每回合使用第0张红色杀不能被响应。<br/>当一名角色使用红色杀造成一点伤害后，或你的准备阶段/回合结束阶段开始时，你选择上述中的一个数字+1。<br/>②出牌阶段，你可以重铸黑色牌。",
	PSjuejing: "绝境",
	PSjuejing_info:
		"锁定技，你的手牌上限+2；当你失去手牌时，你摸一张牌。",
	PSfuzhi: "复制",
	PSfuzhi_info: "一名角色使用牌结算后，你可以使用同名实体牌。",
	PStongli: "同礼",
	PStongli_info:
		"出牌阶段，当你使用即时牌指定第一个目标后，你可令此牌效果额外执行X次（X为你的手牌数）。",
	PSlianhuo: "链祸",
	PSlianhuo_info:
		"锁定技，当你受到火焰伤害时，若你的武将牌处于横置状态且此伤害不为连环伤害，则此伤害+X。(X为处于横置状态的角色数)。你是所有铁索连环伤害的源头。",
	PSyuqi: "隅泣",
	PSyuqi_info:
		"每回合限三次。当有角色受到伤害后，若你至其的距离不大于<span class=thundertext>0</span>，则你可以观看牌堆顶的<span class=firetext>3</span>张牌。你将其中至多<span class=greentext>1</span>张牌交给受伤角色，然后可以获得剩余牌中的至多<span class=yellowtext>1</span>张牌，并将其余牌以原顺序放回牌堆顶。",
	PSshanshen: "善身",
	PSshanshen_info:
		"当有角色死亡时，你可令你的〖隅泣〗中的所有数字+2。然后若你未对该角色造成过伤害，则你回复1点体力。",
	PSxianjing: "娴静",
	PSxianjing_info: "准备阶段，你可令你的〖隅泣〗中的所有数字+1。",
	PShuwei: "虎威",
	PShuwei_info:
		"锁定技，若你的体力值：为4或更少，你视为拥有技能〖涯角〗；为3或更少，你视为拥有技能〖冲阵〗；为2或更少，你视为拥有技能〖龙魂〗；为1或更少，你视为拥有技能〖绝境〗。",
	PSreshanjia: "缮甲",
	PSreshanjia_info:
		"出牌阶段开始时，你可以摸3张牌,然后弃置3张牌，若弃置的牌包含：基本牌，视为对一名角色使用一张【杀】（无距离限制且不计入次数）；锦囊牌，视为使用一张不能被无懈的普通锦囊牌；装备牌，“缮甲”摸牌数+1。",
	PSxiaorui: "骁锐",
	PSxiaorui_info:
		"出牌阶段限一次，你可以失去一点体力获得一名角色两张牌并对其造成一点伤害，若获得牌中有装备你恢复一点体力。",
	PSshanjia: "缮甲",
	PSshanjia_info:
		"出牌阶段开始时，你可以摸三张牌，然后弃置3-X张牌(X为你本局游戏内不因使用而失去过的装备牌的数目且至多为3)。若你没有以此法弃置延时锦囊牌，则你可以视为使用了一张无距离限制且不计入出牌阶段使用次数且无视防具的【杀】，若此杀造成伤害，本局游戏“缮甲”摸牌数和伤害+1。",
	PStuogu: "托孤",
	PStuogu_info:
		"一名角色死亡时，你可以获得其武将牌上的一个技能。",
	PSjiushi: "酒诗",
	PSjiushi_info:
		"锁定技，你永久处于喝酒状态，你可以将一张牌当『酒』使用，你使用『酒』无次数限制",
	PSluoying: "落英",
	PSluoying_info:
		"锁定技：你立即获得任何方式进入弃牌堆的♣牌（自己的牌除外），以此法获得牌不计入手牌上限。",
	PSbaiban: "白板",
	PSbaiban_info:
		"锁定技，若你的体力值为2时，你防止受到小于2的伤害。",
	PSbb_hunzi: "魂姿",
	PSbb_hunzi_info:
		"觉醒技，准备阶段，若你的体力值为1，你减1点体力上限，并获得技能〖英姿〗和〖英魂〗。",
	PSbb_yingzi: "英姿",
	PSbb_yingzi_info:
		"摸牌阶段，你可以多摸X张牌（X为你的体力上限），你的手牌上限为你的体力上限。",
	PSbb_yinghun: "英魂",
	PSbb_yinghun_info:
		"准备阶段开始时，你可令一名角色执行一项：摸X张牌，然后弃置一张牌；或摸一张牌，然后弃置X张牌（X为你的体力上限）。",
	PSmiewu: "灭吴",
	PSmiewu_info:
		"每回合限一次，你可以将一张牌当做任意一张基本牌或锦囊牌使用或打出，然后你摸一张牌。",
	PSqiyang: "弃养",
	PSqiyang_info:
		"锁定技，你的回合外，若你不因〖灭吴〗获得牌时，弃置之。",
	PSmn_quanji: "权计",
	PSmn_quanji_info:
		"你的手牌上限基数为0。当你受到1点伤害后，你可以摸两张牌。出牌阶段，你可以将任意张手牌置于武将牌上，称为“权”。你的手牌上限+X（X为武将牌上“权”的数量）。",
	PSmn_paiyi_backup: "排异",
	PSmn_paiyi: "排异",
	PSmn_paiyi_info:
		"出牌阶段限X次，你可以移去一张“权”并选择一名角色，令其摸两张牌，然后若其手牌数大于你，你对其造成1伤害。（X为场上与你距离不大于1的角色数）",
	PSjiufa: "九伐",
	PSjiufa_info:
		"锁定技，当你使用牌指定其他角色时，你获得等同于目标数的“伐”标记。每回合限一次，当你的“伐”不小于九时，你移去九个“伐”并展示牌堆顶的九张牌，获得其中较多的同色牌。",
	PSkefu: "克复",
	PSkefu_info:
		"你可以将X张牌当作不计入次数且无次数限制的【杀】使用或打出（X为你当前体力值），此【杀】造成伤害后你回复一点体力，若不能回复则增加一点体力上限。",
	PSjingjia1: "精甲",
	PSjingjia1_info:
		"锁定技，游戏开始时，你将五张对应装备栏的装备牌置入你的装备区；当你即将废除装备区或失去装备区的牌时，取消之。",
	PSbaguan1: "霸关",
	PSbaguan1_info:
		"锁定技，你的初始手牌数为8，游戏开始时，你将四张虎牢关专属装备置入牌堆，每名角色回合结束后，你执行一个额外回合，你无法因此连续行动两个回合。当你的体力值不大于已损失体力值/游戏第二轮开始时/你将要阵亡时，终止阵亡结算，选择将武将牌替换为“暴怒战神”、“神鬼无前”或“炼狱修罗”，然后将体力值和体力上限调整为6并立即开始你的回合。",
	PSaozhan1: "鏖战",
	PSaozhan1_info:
		"锁定技，若你装备区内有：武器牌，你可以多使用一张【杀】；防具牌，你受到的伤害始终为一；坐骑牌，摸牌阶段多摸一张牌；宝物牌，跳过你的判定阶段，且你无法被翻面。",
	PSshenwei2: "神威",
	PSshenwei2_info:
		"锁定技，判定阶段，若你的判定区有牌，则你须弃置两张牌，然后弃置自己判定区内的所有牌；摸牌阶段，你额外摸三张牌，你的手牌上限为你的体力上限。",
	PSshenji2: "神戟",
	PSshenji2_info:
		"出牌阶段限两次，你可以弃置一张牌，然后获得未拥有的一项效果直到回合结束：<br/>一、使用【杀】可以额外指定两名目标。<br/>二、使用【杀】无距离限制，且次数+1。<br/>三、使用【杀】造成伤害+1。<br/>四、使用【杀】指定目标时，目标须弃置一张牌。",
	PSshenzhu: "神铸",
	PSshenzhu_info: "出牌阶段，你可以将两张装备牌合成一张装备牌。",
	PSwantian: "挽天",
	PSwantian_info:
		"出牌阶段限一次，你可以将体力上限调整为一，你每以此法失去一点体力或体力上限摸一张牌。",
	PStaoluan: "滔乱",
	PStaoluan_info:
		"每回合每种牌名限一次，你可以将一张牌当做任意一张基本牌或锦囊牌使用或打出，然后你摸一张牌。",
	PSbaguan2: "霸关",
	PSbaguan2_info:
		"每轮限一次，回合开始阶段/出牌阶段/回合结束阶段可发动，你可以将武将牌替换为“暴怒战神”“神鬼无前”或“炼狱修罗”（三种形态共享次数），〖狂暴〗或由〖神戟〗〖极武〗获得的效果不会因武将牌替换而消失。",
	PSshenqu3: "神躯",
	PSshenqu3_info:
		"锁定技，一名角色准备阶段，若你的手牌数不大于体力上限，你摸X+1张牌（X为你已损失的体力值且至多为2）。当你受到伤害后，若你手牌中有【桃】，则你使用之。",
	PSjiwu3: "极武",
	PSjiwu3_info:
		"出牌阶段限两次，你可以弃置一张牌，然后选择获得【强袭】、【铁骑】、【旋风】、【完杀】中的一项技能直到回合结束。",
	PSkuangbao4: "狂暴",
	PSkuangbao4_info:
		"锁定技，游戏开始时，你获得两枚“暴怒”标记；当你造成/受到伤害后，你获得1枚“暴怒”标记。（你的“暴怒”标记至多为6）",
	PSxianfu: "先辅",
	PSxianfu_info:
		"锁定技，游戏开始时，你选择一名其他角色，当其受到伤害/回复体力/摸牌/弃牌后，你受到等量的伤害/回复等量的体力/摸等量的牌/弃置等量的牌。〖先辅〗角色死亡后，你重新选择一名〖先辅〗角色。",
	PSchouce: "筹策",
	PSchouce_info:
		"当你受到1点伤害后，你可以判定，若结果为：黑色，你弃置一名角色区域里的一张牌；红色，你选择一名角色，其摸一张牌，若其是〖先辅〗选择的角色，改为其摸两张牌。",
	PSdanda: "胆大",
	PSdanda_info:
		"锁定技，其他角色的准备阶段，你与其依次比较双方的手牌数，体力值与装备区牌数，你每有一项大于该角色则摸一张牌。 若均大于该角色，你加1点体力上限。",
	PSxiaozhan: "骁战",
	PSxiaozhan_info:
		"当你使用【杀】造成伤害后，你摸X张牌且当前回合使用【杀】次数+X（X为此【杀】造成的伤害数），每当你击杀一名角色时你将手牌数摸至体力上限。",
	PSzengxi: "赠玺",
	PSzengxi_info:
		"觉醒技，准备阶段，若你装备区的牌数不少于2，你加一点体力上限并回复一点体力，将装备区的所有牌交给一名其他角色，其将一半手牌（向下取整）交给你，然后你获得技能〖虎踞〗。",
	PShuju: "虎踞",
	PShuju_info:
		"你使用牌无距离限制。出牌阶段，你可以摸等同于自身已损失体力值的牌，然后减一点体力上限，本回合使用牌的伤害基数和回复基数+1。",
	PSluansha: "乱杀",
	PSluansha_info:
		"锁定技，当你使用牌结算后，若此牌没有造成伤害，你摸等同于此牌目标数的牌。",
	PShengce: "衡策",
	PShengce_info:
		"准备阶段，你可以从以下选项中选择一项：<br/> 1.对一名角色造成两点伤害 <br/>2.令一名角色摸四张牌 <br/>3.令一名角色弃四张牌<br/> 4.获得一名角色两张牌 <br/>5.令一名角色恢复两点体力 <br/>6.令一名角色增加两点体力上限",
	PSdwww_zhiheng: "制衡",
	PSdwww_zhiheng_info:
		"出牌阶段限一次，你可以摸 X+1张牌，然后弃置 X张牌  ，若你以此法弃置的牌中包含：1．锦囊牌，本回合你可以将制衡修改为出牌阶段限两次；2．装备牌，你本回合使用牌没有距离限制。( x 为你的手牌数且最少为 1)",
	PSxiangong: "献贡",
	PSxiangong_info:
		"魏势力技，锁定技，当你不于弃牌阶段弃置牌时，你将弃置的牌置于一名没有【贡】武将上，称之为【贡】。当你受到伤害时，你选择有【贡】且【贡】数量不小于伤害值的角色，其获得等量的【贡】然后将你此伤害转移给该角色。",
	PScuicheng: "摧城",
	PScuicheng_info:
		"吴势力技，觉醒技，准备阶段开始时，若你本局游戏造成过伤害且发动过至少三次【制衡】，你恢复一点体力并摸一张牌，然后从你已开通的吴势力武将中挑选四名武将，并选择三个技能获得之。",
	// "PScuicheng_append": '<span style="font-family: yuanli">开启扩展“天牢令”体验更佳</span>',
	PSzhaohan: "昭汉",
	PSzhaohan_info:
		"锁定技，准备阶段，你加一点体力上限并回复一点体力。",
	PSyizheng: "义争",
	PSyizheng_info:
		"出牌阶段限两次，你可以与一名体力值不大于你的角色拼点：若你赢，跳过其下个摸牌阶段；若你没赢，其减一点体力上限并弃置区域内所有牌。",
	PStanbei: "贪狈",
	PStanbei_info:
		"出牌阶段对每名其他角色限一次，你可以指定一个目标角色，选择一项：1. 你随机获得其一个区域的一张牌，此回合不能再对其使用牌；2. 令你此回合对其使用牌没有次数和距离限制。",
	PSsidao: "伺盗",
	PSsidao_info:
		"出牌阶段，当你对一名其他角色每连续使用两张牌后，你可将一张手牌当无距离限制的顺手牵羊对其使用",
	PSshenfen4: "神愤",
	PSshenfen4_info:
		"出牌阶段限两次，你可以弃置一定数量的“狂暴”标记，然后执行一项效果: <br/>一枚：你选择回复一点体力或令一名其他角色失去一点体力<br/>两枚：你使用的下一张非延时锦囊牌可额外指定两名角色为目标(铁锁连环改为增加一个目标)，若该锦囊牌的目标包括自己，你收回此牌<br/>三枚：你摸三张牌并弃置场上所有其他角色四张手牌和装备区内的所有牌<br/>四枚:所有其他角色受到一点无来源伤害，然后你获得X枚“狂暴”标记( X为场上受到伤害的角色数，以此法获得的“狂暴”标记最多为3 )",
	PSdingjun: "定军",
	PSdingjun_info:
		"每当你使用【杀】指定唯一目标时，你根据此【杀】的花色获得以下效果：<br/>黑桃，此【杀】伤害＋X ；<br/>梅花，本回合使用【杀】次数＋X ；<br/>方片，摸X张牌；<br/>红桃，获得X点护甲；<br/>X为此【杀】的点数。",
	PShuishi: "慧识",
	PShuishi_info:
		"出牌阶段限一次。你可进行判定牌不置入弃牌堆的判定。若判定结果与本次发动技能时的其他判定结果的点数均不相同，则你加1点体力上限（若你的体力上限不小于10则不加），且可以重复此流程。然后你将所有位于处理区的判定牌交给一名角色。若其手牌数为全场最多，则你减1点体力上限。",
	PSluoshen: "洛神",
	PSluoshen_info:
		"锁定技，每名角色回合结束阶段开始时，须选择一项：1.弃置两张花色不同的黑色牌；2.展示牌堆底三张牌，将其中的黑色牌置于你武将牌上，称为“洛神”，你可以将洛神牌如手牌般使用或打出。",
	PSqingguo: "倾国",
	PSqingguo_info:
		"你可以将一张黑色牌或洛神牌当【闪】使用或打出，该【闪】生效后，你可以将之置于牌堆底。",
	PSwu_tuxi: "突袭",
	PSwu_tuxi_info:
		"摸牌阶段，你可以少摸任意张牌并获得等量的其他角色区域内等量的牌。",
	PSwu_zhenzhan: "阵斩",
	PSwu_zhenzhan_info:
		"锁定技。其他角色使用多目标的牌指定目标时/于弃牌阶段外弃置牌后，你对其造成X点伤害。（X为此牌目标数/弃置的牌数，且至多为你已损失体力值，至少为1）",
	PSyingjian: "影箭",
	PSyingjian_info:
		"准备阶段开始时/判定阶段开始时/摸牌阶段开始时/弃牌阶段开始时/结束阶段开始时/出牌阶段限一次，你可以视为使用一张无视防具，无距离限制，不计入次数的【杀】。",
	PSshixin: "释衅",
	PSshixin_info:
		"锁定技，防止你受到火属性伤害，你受到的非火焰伤害-1；你于回合内第一次造成伤害时，回复一点体力。",
	PSxingtu: "行图",
	PSxingtu_info:
		"锁定技。①当你使用有点数的牌结算结束后，你将此牌点数记录为X。②当你使用牌时，系统随机给出此牌的点数Y与X的四则运算式子（除法除外），你需要在3秒内选择答案；若答案正确，你摸一张牌，否则此效果本回合失效③你使用②摸到的牌无次数限制。",
	PSjuezhi: "爵制",
	PSjuezhi_info:
		"出牌阶段限一次，你可以弃置两张牌，然后摸两张牌，令〖行图〗②重新生效。",
	PSlongnu: "龙怒",
	PSlongnu_info:
		"转换技，锁定技，阳：出牌阶段开始时，你失去1点体力并摸一张牌，然后本阶段内你视为拥有技能〖怒斩〗，且你的红色手牌均视为火【杀】且无距离限制。阴：出牌阶段开始时，你减1点体力上限并摸一张牌，然后本阶段内你然后本阶段内你视为拥有技能〖厉勇〗，且你的锦囊牌均视为雷【杀】且无使用次数限制。",
	PSlb_jieying: "结营",
	PSlb_jieying_info:
		"锁定技，游戏开始时或当你的武将牌重置时，你横置；所有已横置的角色手牌上限+2；当你的体力或体力上限变化后，你摸一张牌，然后横置一名其他角色。",
	PSsanchen: "三陈",
	PSsanchen_info:
		"出牌阶段限三次，你可以摸3张牌，然后观看一名其他角色的手牌，从中弃置任意张花色不同的牌。",
	PSzhaotao: "诏讨",
	PSzhaotao_info:
		"觉醒技，结束阶段开始时，若你本局游戏已发动两次以上〖三陈〗，你增加一点体力上限并回复一点体力，废除判定区，然后获得〖灭吴〗。",
	PSpozhu: "破竹",
	PSpozhu_info:
		"出牌阶段，你可以弃置两张牌，对一名其他角色造成一点伤害。",
	PSjin_miewu: "灭吴",
	PSjin_miewu_info:
		"锁定技，若你的判定区已废除，则你的判定阶段视为摸牌阶段。",
	PSsb_pingjian: "评荐",
	PSsb_pingjian_info:
		"结束阶段开始时/当你受到伤害后/出牌阶段限一次，你可以令系统随机从剩余武将牌堆中检索出6张拥有发动时机为结束阶段开始时/当你受到伤害后/出牌阶段的技能的武将牌。然后你可以选择尝试发动其中2个技能。每个技能每局只能选择一次。（村：受到伤害后不会失去已获得的“评鉴技能”）",
	// "PSsb_pingjian_append": '<span style="font-family: yuanli">开启扩展“天牢令”体验更佳</span>',
	PSwengua: "问卦",
	PSwengua_info:
		"其他角色/你的出牌阶段限一次，其可以交给你一张牌，(若当前回合角色为你，则跳过此步骤)，你可以将此牌/一张牌置于牌堆顶或牌堆底，然后你与其/你从另一端摸一张牌",
	PSwengua_1: "问卦·升级",
	PSfuzhu_info:
		"使命技。①一名男性角色的结束阶段，若牌堆剩余牌数不大于你体力值的十倍，则你可以依次对其使用牌堆中所有的【杀】（不能超过游戏人数），然后洗牌。②成功：当你因〖伏诛〗①杀死该角色后，你摸Y张牌，然后升级〖问卦〗（Y为你发动〖伏诛〗①造成伤害数的一半，向上取整）。③失败：当你发动〖伏诛〗①没有杀死该角色，你回复一点体力（若体力值已满，则摸一张牌）。",
	PSfuzhu: "伏诛",
	PSwengua_1_info:
		"其他角色/你的出牌阶段限一次，其可以交给你一张牌，(若当前回合角色为你，则跳过此步骤)，然后你与其/你从牌堆顶或牌堆底摸一张牌。你的问卦牌不计入手牌上限，当你失去问卦牌时，你摸一张牌。",
	PSluanwu: "乱武",
	PSluanwu_info:
		"出牌阶段限一次。你可以选择至少两名角色，然后每名你选择的角色依次视为对这些角色中与其逆时针座次最近的另一名角色使用一张不计入次数的【杀】。",
	PSwansha: "完杀",
	PSwansha_info:
		"锁定技，你的回合内，除你以外，进入濒死状态的角色立即死亡，且使其进入濒死状态的角色视为杀死其的角色。",
	PSduorui: "夺锐",
	PSduorui_info:
		"出牌阶段，你可以废除一个装备栏，然后获得场上的一个技能。当你于出牌阶段内对一名其他角色造成伤害后，你可以令该角色的一个技能失效直到其回合结束。",
	// "PSduorui_append": '<span style="font-family: yuanli">开启扩展“天牢令”体验更佳</span>',
	PSwusheng: "武圣",
	PSwusheng_info:
		"你可以将一张红色牌当做【杀】使用或打出。你使用的♦杀没有距离限制且可以获得对方一张牌；你使用的♥杀造成伤害+1，且目标需要连续使用两张【闪】才能抵消。",
	PSmashu: "马术",
	PSmashu_info:
		"锁定技，你计算与其他角色的距离时-1，其他角色计算与你的距离时+1。",
	PSyijue: "义绝",
	PSyijue_info:
		"出牌阶段限一次，你可以弃置一张牌并令一名有牌的其他角色选择交给你一张由你声明花色和类型的牌。若其选择不交出，你摸一张牌，该角色不能使用或打出牌，非锁定技失效且受到来自你的【杀】伤害+1直到回合结束。否则你可以令其回复一点体力。",
	PSshencai: "神裁",
	PSshencai_info:
		"出牌阶段限一次，你可以令一名其他角色进行判定。你获得此判定牌，然后若此判定牌：包含以下要素中的任意一个，获得对应的效果：{⒈体力：当其受到伤害后，其失去等量的体力、⒉武器：其不能使用牌响应杀、⒊打出：当其失去手牌后，其再随机弃置一张手牌（不嵌套触发）、⒋距离：其的结束阶段开始时，其翻面}；若均不包含，你获得其区域里的一张牌，其获得一枚“死”并获得如下效果：其的角色手牌上限-X、其的回合结束时，若X大于场上存活人数，则其死亡（X为其“死”标记数）。",
	PSxunshi: "巡使",
	PSxunshi_info:
		"锁定技。①你手牌区内所有的多目标锦囊牌均视为花色为none的普【杀】。②你使用颜色为none的牌无距离和次数限制。③当你使用无颜色的牌选择目标后，你令你的〖神裁〗的发动次数上限+1（至多为5），然后可以为此牌增加任意个目标。",
	PStaoyuan: "桃园",
	PStaoyuan_info:
		"锁定技，当你体力减少后，你从牌堆顶亮出X张牌，若亮出的牌颜色不全为黑色，则你将体力回复到1，然后你指定一名角色，令其从三张未登场的蜀势力武将牌中选择一名获得上面所有技能。（X为场上蜀势力角色的数量）",
	PSshiren: "识人",
	PSshiren_info:
		"你的手牌上限加X。出牌阶段限制一次，你可以与你攻击范围内的一名角色进行拼点，若你赢，则该角色的势力变为蜀势力。（X为场上蜀势力角色的数量）",
	PStuoyu: "拓域",
	PStuoyu_info:
		"①锁定技。当你使用拥有对应副区域标签的牌时，你令此牌获得对应效果。丰田：伤害值或回复值+1；清渠：无次数和距离限制；峻山：不可被响应。②出牌阶段开始时和结束时，你给你的手牌分配对应的已激活副区域标签，已分配的手牌不计入手牌上限（每个区域至多五张）。",
	PSxianjin: "险进",
	PSxianjin_info:
		"锁定技，每轮开始时/当你造成或受到2次伤害后，你激活一个副区域，若你区域均已开发，则改为下回合开始前你执行一个回合，然后摸X张牌（X为已开发的副区域数）。",
	PSqijing: "奇径",
	PSqijing_info:
		"觉醒技，每轮结束后，若你的手牌副区域均已开发，你减1体力上限，获得〖摧心〗，然后将座次移动至除你以外的两名相邻角色之间。",
	PSlingce: "灵策",
	PSlingce_info:
		"锁定技，当牌堆洗牌时，你观看牌堆顶8张牌，并从中获得牌名不同的牌，剩余的牌进入弃牌堆。",
	PStianzuo: "天佐",
	PStianzuo_info:
		"出牌阶段限一次/当你受到一点伤害后/回合结束时，若弃牌堆有牌，你可以令牌堆洗牌。",
	PSdinghan: "定汉",
	PSdinghan_info:
		"觉醒技，当你本局游戏至少发动过三次〖天佐〗，你增加一点体力上限并回复一点体力，获得技能〖佐定〗，然后将〖灵策〗中“获得牌名不同的牌”修改为“ 获得其中至多六张牌”。",
	PSzuoding: "佐定",
	PSzuoding_info:
		"出牌阶段限三次，你可以将一张牌当【奇正相生】使用。",
	PSzhengu: "镇骨",
	PSzhengu_info:
		"结束阶段，你可以选择一名其他角色，然后你令你或其成为“高达”（“高达”效果：手牌数始终保持与对方一致，直到下回合结束时。一名角色不能重复成为“高达”）。",
	PSchenglve: "成略",
	PSchenglve_info:
		"转换技，出牌阶段限一次，阴：你可以摸一张牌，然后弃置两张手牌。阳：你可以摸两张牌，然后弃置一张手牌。若如此做，直到本回合结束，你使用与弃置牌花色相同的牌无距离和次数限制，且当你使用/打出/弃置与弃置牌花色相同的牌后，你摸一张牌。",
	PSshicai: "恃才",
	PSshicai_info:
		"当你使用牌时，若此牌与你本回合使用的牌名均不同，则你可以将此牌置于牌堆顶，然后摸一张牌。",
	PSpingjian_use: "评荐",
	PSlvli: "膂力",
	PSlvli_info:
		"每回合限一次，当你造成伤害后，你可以将手牌摸至与体力值相同或将体力回复至与手牌数相同。",
	PSchoujue: "仇决",
	PSchoujue_info:
		"觉醒技，每个回合结束时，若你的体力上限大于4，你获得技能〖背水〗，然后删去〖膂力〗描述中的“每回合限一次。",
	PSbeishui: "背水",
	PSbeishui_info:
		"觉醒技，准备阶段，若你的体力值不小于3，你获得〖清剿〗，然后将〖膂力〗改为受到伤害后也可以发动。",
	PSqingjiao: "清剿",
	PSqingjiao_info:
		"摸牌阶段，你可以多摸两张牌，且你本回合可以额外使用一张【杀】。你使用的【杀】无距离限制且无视防具。",
	PSrebolan: "博览",
	PSrebolan_info:
		"出牌阶段限两次，你可以从六个含有“出牌阶段”的技能中选择一个技能，令场上一名角色获得之直到其下回合结束。其他角色的出牌阶段限一次，其可以失去1点体力，令你从六个含有“出牌阶段”的技能中选择一个，其获得此技能直到此阶段结束。",
	PSguangu: "观骨",
	PSguangu_info:
		"每名角色每回合限一次，当一名角色发动“出牌阶段”的技能后，你可以观看一名角色至多X张手牌，你可以将这些牌与牌顶堆的X张牌交换。若如此做，你可以使用其中一张被交换的手牌。（X为你体力值）",
	PSnandou: "南斗",
	PSnandou_info:
		"限定技，你可以将一张基本牌当作锦囊牌使用。",
	PSbeidou: "北斗",
	PSbeidou_info:
		"限定技，你可以将一张装备牌当作基本牌使用。",
	PSwuji: "武吉",
	PSwuji_info:
		"你可以将一张锦囊牌当作无次数限制的基本牌使用。",
	PSdaogu: "道骨",
	PSdaogu_info:
		"锁定技，你每发动过【3】次技能（〖道骨〗除外），你选择一项：1、失去你的一个技能，然后将〖道骨〗描述中【】内的数字减1（至少为1）。2、重置或恢复场上的一个技能（若为〖南斗〗或〖北斗〗，则改为重置并失去限定技标签）。3、随机获得场上的一个技能，直到你下回合结束。",
	PSfaxiao: "发笑",
	PSfaxiao_info:
		"转换技，当你受到伤害后，或当你于回合外失去牌后，阳：你可以念一句文本包含“哼”、“呵”、“哈”的台词（随机三个自选其一）；阴：你获得你上一次所念的台词所属的技能。若已获得该技能，则：若因伤害触发，则对所有其他角色各造成一点伤害，否则弃置所有其他角色各一张牌。",
	PSshouye: "守邺",
	PSshouye_info:
		"每一轮开始时，你获得技能〖协守〗并且可以令一名角色获得技能〖协守〗直到下一轮开始。当一名角色失去技能〖协守〗时，其恢复一点体力。",
	PSliezhi: "烈直",
	PSliezhi_info:
		"回合开始时或回合结束时，你可以视为使用一张【万箭齐发】，并弃置一种类型的所有手牌。",
	PSxieshou: "协守",
	PSxieshou_info:
		"锁定技，你不能成为【决斗】的目标且不能使用【决斗】。当你响应牌后，你可以令一名拥有技能〖协守〗的其他角色摸一张牌；当你弃置手牌后，你可以将其中至多X张弃置牌交给给同势力或拥有〖协守〗的角色（X为你的体力值）。",
}

export { characterTranslation, skillTranslation }
